### Data Cleaning Pandas Assignment | Shivam Negi

In [220]:
import pandas as pd
import numpy as np

In [221]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                    'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                    'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                    'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
                    '12. Air France', '"Swiss Air"']})

In [222]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

### Task 1:
    Some values in the the FlightNumber column are missing. These numbers are
    meant to increase by 10 with each row so 10055 and 10075 need to be put in
    place. Fill in these missing numbers and make the column an integer column
    (instead of a float column).

In [223]:
df.loc[1, 'FlightNumber'] = 10055        # Filling Missing Values
df.loc[3, 'FlightNumber'] = 10075
df

df['FlightNumber'] = [int(i) for i in df['FlightNumber']]  # Converting Values of FilghtNumber into integer

df['FlightNumber'].dtypes

dtype('int64')

### Task 2:

    The From_To column would be better as two separate columns! Split each
    string on the underscore delimiter _ to give a new temporary DataFrame with
    the correct values. Assign the correct column names to this temporary
    DataFrame.

In [224]:
temp = df['From_To'].str.split('_')  # Splitting and assign as Series

#Storing From, To in Seperate Columns of temporary dataframe
temp_df = pd.DataFrame({
    
    'From' : [temp[0] for temp in temp],
    'To'   : [temp[1] for temp in temp]
})

temp_df

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

### Task 3:


    Notice how the capitalisation of the city names is all mixed up in this
    temporary DataFrame. Standardise the strings so that only the first letter is
    uppercase (e.g. "londON" should become "London".)

In [225]:
# Standardizing strings
temp_df['From'], temp_df['To'] = [i.title() for i in temp_df['From']], [i.title() for i in temp_df['To']] 

temp_df

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

### Task 4:

    Delete the From_To column from df and attach the temporary DataFrame
    from the previous questions.

In [226]:
df.drop('From_To', axis = 1, inplace = True)      # Deleting 'From_To' Column

df

result = pd.concat([temp_df, df], axis = 1)       # concatenate df and temp_df
result

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris         10045      [23, 47]               KLM(!)
1    Madrid      Milan         10055            []    <Air France> (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris         10075          [13]       12. Air France
4  Brussels     London         10085      [67, 32]          "Swiss Air"

### Task 5:

    In the RecentDelays column, the values have been entered into the
    DataFrame as a list. We would like each first value in its own column, each 
    second value in its own column, and so on. If there isn't an Nth value, the value
    should be NaN.
    Expand the Series of lists into a DataFrame named delays, rename the columns
    delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
    with delays.

In [227]:
length = [len(i) for i in result['RecentDelays']]
l = sorted(length)
n = l[-1]





# Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc.

delays = pd.DataFrame()

for i in range(1,n+1):
    delays['delay_' + str(i)] = None

delays['delay_1'] = [None if len(i) == 0  else i[0] for i in result['RecentDelays']]
delays['delay_2'] = [None if len(i) < 2   else i[1] for i in result['RecentDelays']]
delays['delay_3'] = [None if len(i) < 3   else i[2] for i in result['RecentDelays']]



# replace the unwanted RecentDelays column in df with delays.

result.drop(['RecentDelays'], axis=1, inplace=True)

result_df = pd.concat([result, delays], axis = 1)

result_df

,From,To,FlightNumber,Airline,delay_1,delay_2,delay_3
0,London,Paris,10045,KLM(!),23.0,47.0,NaN
1,Madrid,Milan,10055,<Air France> (12),NaN,NaN,NaN
2,London,Stockholm,10065,(British Airways. ),24.0,43.0,87.0
3,Budapest,Paris,10075,12. Air France,13.0,NaN,NaN
4,Brussels,London,10085,"""Swiss Air""",67.0,32.0,NaN